novaeco/Display_bmp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_SDMMC_BUS_WIDTH_1=y
CONFIG_DISPLAY_WIDTH=1024
CONFIG_DISPLAY_HEIGHT=600
CONFIG_DISPLAY_MARGIN_LEFT=120
CONFIG_DISPLAY_MARGIN_RIGHT=120
CONFIG_DISPLAY_MARGIN_TOP=0
CONFIG_DISPLAY_MARGIN_BOTTOM=0
CONFIG_DISPLAY_ORIENTATION_LANDSCAPE=y
CONFIG_IMAGE_FETCH_URL="http://example.com/image.png"
CONFIG_WIFI_PROV_TRANSPORT_SOFTAP=y
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_UPLOAD_MAX_BYTES=1048576
CONFIG_UPLOAD_AUTH_TOKEN=""

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_LV_CONF_INCLUDE_SIMPLE=y
